#1 Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь

n = int(input("Введите трехзначное число "))
a = n // 100
b = n // 10 % 10
c = n % 10
print("Произведение ровняется", a * b * c)
print("Сумма ровняется", a + b + c)

#2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

a = 5
b = 6
print(a, bin(a))
print(b, bin(b))
print("Логическое ИЛИ", a | b)
print("Логическое И", a & b)
print("Логическое исключающее или", a ^ b)
print("Логическое отрицание", ~ a)
print("Сдвиг влево на два знака", a<<2)
print("Сдвиг вправо на два знака", 2>>a)

# 3.	По введенным пользователем координатам двух точек вывести
# уравнение прямой вида y = kx + b, проходящей через эти точки.

x1 = int(input ("Введите координаты точки А, x1. "))
y1 = int(input ("Введите координаты точки А, y1. "))
x2 = int(input("Введите координаты точки B, x2. "))
y2 = int(input("Введите координаты точки B, y2. "))

k = (x1 - x2) /(y1 - y2)
b = y2 - k * x2
print("Уравнение", "y = {}*x + {}".format (k, b))

4. Написать программу, которая генерирует в указанных пользователем границах:
#случайное целое число;

num1 = int(input('Введите минимальное число '))
num2 = int(input('Введите максимальное число '))


import random
print(random.randint(num1, num2))

#случайное вещественное число;
first = float(input('Введите число '))
second = float(input('Введите число '))

print(random.uniform(first, second))

#случайный символ.
symbol_1 = ord(input("Введите первый символ "))
symbol_2 = ord(input("Введите второй символ "))

result = chr(random.randint(int(symbol_1), int(symbol_2)))
print(result)


#5.	Пользователь вводит две буквы. Определить, на каких местах
# алфавита они стят, и сколько между ними находится букв.

letter_1 = ord(input("Введите первый символ "))
letter_2 = ord(input("Введите второй символ "))

if letter_1 > letter_2:
    distance = letter_1 - letter_2

elif letter_1 < letter_2:
    distance = letter_2 - letter_1
elif letter_1 == letter_2:
    print("Буквы совпадают")
print("Между буквами находится {} букв".format(distance))

alf_place1 = letter_1 - ord('A')
alf_place2 = letter_2 - ord('A')
print(alf_place1, alf_place2)


# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

letter = ord(input("Введите любую заглавную букву латиницей "))
print("Ваша буква ", chr(letter), 'позиция буквы', letter - ord('A'))

#7.	По длинам трех отрезков, введенных пользователем, определить возможность
#существования треугольника, составленного из этих отрезков. Если такой
#треугольник существует, то определить, является ли он
#разносторонним, равнобедренным или равносторонним.

line_a = int(input("Введите длину первого отрезка "))
line_b = int(input("Введите длину второго отрезка " ))
line_c = int(input("Введите длину третьего отрезка "))

if line_a + line_b > line_c and line_c + line_b > line_a and line_a + line_c > line_b:
    if True:
        if line_a != line_b  and line_b != line_c and line_c != line_a:
            print("Треугольник разносторонний")
        elif line_a == line_b or line_b == line_c or line_c == line_a:
            print("Это равнобедренный треугольник")
        elif line_a == line_b == line_c:
            print("Это равносторонний треугольник")
else:
    print("Треугольника не существует")


#8. Определить, является ли год, который ввел пользователем, високосным или не високосным.

year = int(input("Введите год "))

if year % 4 != 0:
    print(year, '- невисокосный')
elif year % 100 == 0:
    if year // 400 == 0:
        print(year, '- год високосный')
    else:
        print(year, '- год невисокосный')
else:
    print(year, '- год високосный')

#9. Вводятся три разных числа. Найти, какое из них является средним (больше одного, но меньше другого).

a = int(input("Введите число "))
b = int(input("Введите число "))
c = int(input("Введите число "))

if c < a < b or b < a < c:
    print("Среднее число", a)
elif c < b < a or a < b < c:
    print("Среднее число", b)
elif c == b == a:
    print("Числа равны")
else:
    print("Среднее число", c)


